# Importing Libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.metrics import accuracy_score,f1_score,confusion_matrix,recall_score,precision_score,mean_squared_error
from sklearn.model_selection import train_test_split,cross_val_score,cross_val_predict
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor,AdaBoostRegressor,BaggingRegressor,ExtraTreesRegressor,GradientBoostingRegressor
from sklearn.tree import DecisionTreeRegressor
from joblib import load,dump
import numpy as np
from sklearn.naive_bayes import GaussianNB
from xgboost import XGBRegressor
from sklearn.linear_model import SGDRegressor
from sklearn.kernel_ridge import KernelRidge
from sklearn.linear_model import ElasticNet
from sklearn.linear_model import BayesianRidge
from sklearn.svm import SVR
from lightgbm import LGBMRegressor
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error
from catboost import CatBoostRegressor
from joblib import dump,load

# EDA

In [2]:
df = pd.read_csv('car_purchasing.csv',encoding='latin-1')

In [3]:
df.head()

,customer name,customer e-mail,country,gender,age,annual Salary,credit card debt,net worth,car purchase amount
0,Martina Avila,cubilia.Curae.Phasellus@quisaccumsanconvallis.edu,Bulgaria,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,Harlan Barnes,eu.dolor@diam.co.uk,Belize,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,Naomi Rodriquez,vulputate.mauris.sagittis@ametconsectetueradip...,Algeria,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,Jade Cunningham,malesuada@dignissim.com,Cook Islands,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,Cedric Leach,felis.ullamcorper.viverra@egetmollislectus.net,Brazil,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248

In [4]:
df.tail()

,customer name,customer e-mail,country,gender,age,annual Salary,credit card debt,net worth,car purchase amount
495,Walter,ligula@Cumsociis.ca,Nepal,0,41.462515,71942.40291,6995.902524,541670.1016,48901.44342
496,Vanna,Cum.sociis.natoque@Sedmolestie.edu,Zimbabwe,1,37.642000,56039.49793,12301.456790,360419.0988,31491.41457
497,Pearl,penatibus.et@massanonante.com,Philippines,1,53.943497,68888.77805,10611.606860,764531.3203,64147.28888
498,Nell,Quisque.varius@arcuVivamussit.net,Botswana,1,59.160509,49811.99062,14013.034510,337826.6382,45442.15353
499,Marla,Camaron.marla@hotmail.com,marlal,1,46.731152,61370.67766,9391.341628,462946.4924,45107.22566

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   customer name        500 non-null    object
 1   customer e-mail      500 non-null    object
 2   country              500 non-null    object
 3   gender               500 non-null    int64
 4   age                  500 non-null    float64
 5   annual Salary        500 non-null    float64
 6   credit card debt     500 non-null    float64
 7   net worth            500 non-null    float64
 8   car purchase amount  500 non-null    float64
dtypes: float64(5), int64(1), object(3)
memory usage: 35.3+ KB

In [6]:
df.describe()

,gender,age,annual Salary,credit card debt,net worth,car purchase amount
count,500.000000,500.000000,500.000000,500.000000,500.000000,500.000000
mean,0.506000,46.241674,62127.239608,9607.645049,431475.713625,44209.799218
std,0.500465,7.978862,11703.378228,3489.187973,173536.756340,10773.178744
min,0.000000,20.000000,20000.000000,100.000000,20000.000000,9000.000000
25%,0.000000,40.949969,54391.977195,7397.515792,299824.195900,37629.896040
50%,1.000000,46.049901,62915.497035,9655.035568,426750.120650,43997.783390
75%,1.000000,51.612263,70117.862005,11798.867487,557324.478725,51254.709517
max,1.000000,70.000000,100000.000000,20000.000000,1000000.000000,80000.000000

In [7]:
df.drop("customer name",axis = 1,inplace= True)

In [8]:
df.drop("customer e-mail",axis = 1,inplace= True)

In [9]:
df.drop("country",axis = 1,inplace= True)

In [10]:
df.head()

,gender,age,annual Salary,credit card debt,net worth,car purchase amount
0,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248

In [11]:
corr = df.corr()
corr['car purchase amount'].sort_values(ascending=False)

car purchase amount    1.000000
age                    0.632865
annual Salary          0.617862
net worth              0.488580
credit card debt       0.028882
gender                -0.066408
Name: car purchase amount, dtype: float64

# Training

In [12]:
x = df.drop(['car purchase amount'], axis='columns')
y = df.get("car purchase amount")

In [13]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2,random_state=10)

# Model selection

In [14]:
models = []
models.append(('LR',LinearRegression()))
# models.append(('Ex',ExtraTreesRegressor()))
# models.append(('Dt',DecisionTreeRegressor()))
# models.append(('AR',AdaBoostRegressor()))
# models.append(('RR',RandomForestRegressor()))
# models.append(('Gn',GaussianNB()))
# models.append(('Sg',SGDRegressor()))
# models.append(('Kr',KernelRidge()))
# models.append(('Er',ElasticNet()))
# models.append(('Br',BayesianRidge()))
# models.append(('SVR',SVR()))
# models.append(('Xg',XGBRegressor()))
# models.append(('LG',LGBMRegressor()))
# models.append(('CB',CatBoostRegressor()))
# models.append(('BR',BaggingRegressor()))
# models.append(('GR',GradientBoostingRegressor()))
models

[('LR', LinearRegression())]

In [15]:
results = []
names = []

# Eavluating model

In [16]:
for name, model in models:
    model.fit(x_train,y_train)
    y_pred = model.predict(x_test)
    results.append(mean_squared_error(y_test,y_pred))
    print(results)

[2.390495983876577]

In [17]:

print('MAE:',mean_absolute_error(y_test,y_pred))

MAE: 1.2343031966357376

In [18]:
x_test.head()

     gender        age  annual Salary  credit card debt    net worth
151       1  49.839129    52373.79446      11347.629670  633383.4925
424       1  37.363626    51111.76605       9057.600508  461366.7829
154       1  45.052036    59689.81438      14862.840110  449895.3046
190       1  48.248847    86067.83527       9181.067430  335652.6234
131       1  45.013749    60575.12604       8088.344365  291360.0291

In [19]:
input_1 = np.array([[1,37.363626,51111.76605,9057.600508,461366.7829]])
model.predict(input_1)

D:\anaconda install\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([31410.4112079])

In [20]:
y_test.head()

151    47604.34591
424    31408.62631
154    42369.64247
190    56579.90338
131    38243.66481
Name: car purchase amount, dtype: float64

In [21]:
dump(model,'car.joblib')

['car.joblib']